[
  {
    "name": "Backend разработчик (Python)",
    "salary_from": 250000,
    "salary_to": 500000,
    "url": "https://hh.ru/vacancy/84070104",
    "info": "Образование: не имеет значения. Опыт работы: опыт работы не менее 1 года на аналогичной позиции. SQL. Хорошее знание Python. ",
    "responsibility": "Оперативная и качественная разработка новых веб сайтов разного уровня сложности и Backend для мобильных приложений, доработка и поддержка существующих проектов."
  },
  {
    "name": "Python разработчик",
    "salary_from": 250000,
    "salary_to": null,
    "url": "https://hh.ru/vacancy/83166142",
    "info": "Опыт работы с Python от 1,5 лет. Опыт работы с любым фреймворком для веб-приложений. Уверенный пользователь Linux, Docker. ",
    "responsibility": "Принять участие в разработке нового проекта как backend разработчик. Коммуникация с другими разработчиками и участие в выборе новых технологий. "
  },
  {
    "name": "Программист Python",
    "salary_from": 400000,
    "salary_to": null,
    "url": "https://hh.ru/vacancy/83589408",
    "info": "Опыт работы с Python 3.8, asyncio (async/await), веб-фреймворками (aiohttp/fastAPI/flask/Django), Aiogram (фреймворк для разработки телеграм...",
    "responsibility": "Проект написан на Python (версия 3.7 и выше), Aiogram, Aiohttp с использованием Pydantic и Peewee. Храним данные в MySQL. - "
  },
  {
    "name": "Разработчик Python/Developer Python",
    "salary_from": 250000,
    "salary_to": 400000,
    "url": "https://hh.ru/vacancy/83461035",
    "info": "Уровень кода на не ниже уровня senior. Опыт написания коммерческого кода не менее 3 лет. Должен иметь представление об принципах...",
    "responsibility": "Основная задача: участвующего в разработке подсистемы адаптации AI моделей к распределенным вычислениям в DEKUBE (Kubernetes)."
  },
  {
    "name": "Back End разработчик (PHP или Python)",
    "salary_from": 17000000,
    "salary_to": 20000000,
    "url": "https://hh.ru/vacancy/83154274",
    "info": "Обязательные hard skills к кандидату: - PHP или Python. - git. - MySQL/PostgreSQL. - REST API. - желательно умение писать unit/functional тесты. - ",
    "responsibility": "разработка нового функционала. - рефакторинг кодовой базы. - написание тестов. - при необходимости улучшение структуры БД или ее расширение. - разработка веб-сервисов с..."
  },
  {
    "name": "Middle+ Python Developer (backend)",
    "salary_from": 250000,
    "salary_to": 300000,
    "url": "https://hh.ru/vacancy/84018264",
    "info": "Опыт в проектах на Python (3.8-3.10), Django/FastAPI. — Опыт с библиотеками Celery\\Dramatiq. — Также нам важно хорошее...",
    "responsibility": "Участвовать в командных мероприятиях (оценка задач, планирование спринта, ретроспектива). — Декомпозиция, разработка, исправление багов, доведение до прода, поддержка после прода. — "
  },
  {
    "name": "Python Backend-разработчик",
    "salary_from": 250000,
    "salary_to": 300000,
    "url": "https://hh.ru/vacancy/84446179",
    "info": "Имеет высшее образование (бакалавр) в области информационных технологий. Владеет английским языком на уровне чтения технической документации и профильных научных публикаций. ",
    "responsibility": "Разрабатывать backend часть для комплексов технического зрения. Участвовать в разработке архитектуры решения. Работать в кооперации с другими командами-разработчиками. "
  },
  {
    "name": "Разработчик Python (FastAPI, MySQL, Clickhouse), удаленно",
    "salary_from": 280000,
    "salary_to": null,
    "url": "https://hh.ru/vacancy/83398316",
    "info": "Опыт web-программирования в backend части. - Опыт работы с СУБД postgres. - Опыт промышленной разработки на Python от 4-х лет. - ",
    "responsibility": "Собрать команду под проект. - Руководить командой проекта. - Оценка бюджета проекта. - Участвовать в создании крутых продуктов. - Проектировать реализацию новых процессов."
  },
  {
    "name": "Senior Python Developer (AI, robotics)",
    "salary_from": 250000,
    "salary_to": 500000,
    "url": "https://hh.ru/vacancy/81940901",
    "info": "Высшее техническое образование или самостоятельный бэкграунд в области робототехники и смежных областей. Опыт разработки и проектирования робототехнических систем. ",
    "responsibility": "Разрабатывать программную начинку робота для уборки улиц. Построить релизный цикл. Автоматизировать тестирование в симуляции для написанного кода. Дорабатывать системы навигации..."
  },
  {
    "name": "Senior Python Developer",
    "salary_from": 300000,
    "salary_to": 400000,
    "url": "https://hh.ru/vacancy/84273897",
    "info": "Есть опыт работы с системными настройками Linux, стандартными сетевыми протоколами и сервисами (напр. Radius, HTTP(s), SMTP, LDAP, DNS), в...",
    "responsibility": "Специфическая обработка протоколов удаленного доступа и передачи файлов, специализированная балансировка нагрузки. - Реализация различных методов обработки передаваемых и накопленных данных. - "
  },
  {
    "name": "Ведущий разработчик Python (FastAPI)",
    "salary_from": 280000,
    "salary_to": null,
    "url": "https://hh.ru/vacancy/83242182",
    "info": "Опыт коммерческой разработки на FastAPI - от 1 года, на Python от 4-5 лет. Опыт работы с Redis, Celery, Git. ",
    "responsibility": "Разработка парсеров сайтов, внутреннего портала и других внутренних продуктов (на выбор)."
  },
  {
    "name": "Разработчик Python Middle+ Senior",
    "salary_from": 250000,
    "salary_to": 350000,
    "url": "https://hh.ru/vacancy/83146353",
    "info": "Глубокое знание Python, способность писать код без фреймворков. Опыт коммерческой разработки на Python от 3х лет. Опыт разработки REST...",
    "responsibility": "Участвовать в разработке продуктов компании на языке программирования - Python. Разрабатывать и поддерживать интеграции со сторонними API. Взаимодействовать с командой аналитиков..."
  },
  {
    "name": "Senior Python Developer ML",
    "salary_from": 300000,
    "salary_to": 350000,
    "url": "https://hh.ru/vacancy/83450677",
    "info": "Практический опыт разработки высоконагруженных систем и их распределение на Java - от 4-х лет. Опыт работы в коммерческой разработке Python...",
    "responsibility": "Проектирование и разработка высоконагруженных сервисов с кластером Hadoop. Проектирование элементов системы с последующей реализацией. Работать в исследовательской команде по направлению..."
  },
  {
    "name": "Ведущий Python разработчик",
    "salary_from": 250000,
    "salary_to": 300000,
    "url": "https://hh.ru/vacancy/81542736",
    "info": "Обязательные навыки и опыт: - Опыт коммерческой разработки на Python 3.7+ от 5 лет. - Опыт работы с FastAPI. - ",
    "responsibility": null
  },
  {
    "name": "Head of Dev Department (Python, Low-Code) / Руководитель отдела разработки",
    "salary_from": 250000,
    "salary_to": 300000,
    "url": "https://hh.ru/vacancy/84156498",
    "info": "Опыт работы более 5 лет с продуктовыми командами в части реализации и внедрения. Хардовый технический бэкграунд (Python; SQL). ",
    "responsibility": "Управление международной командой разработки до 50 человек в штате компании (не аутсорс/аутстафф). Команда распределена между проектами, у каждого проекта..."
  },
  {
    "name": "Senior Python бэкенд разработчик приложений / Backend developer apps",
    "salary_from": 350000,
    "salary_to": null,
    "url": "https://hh.ru/vacancy/82963256",
    "info": "Обогатишь свой опыт участия в разработке и запуске мобильных приложений/сервисов от идеи до вывода на рынок.  Опыт коммерческой разработки...",
    "responsibility": "Senior Backend-разработчик для мобильного приложения Lifestylo!"
  },
  {
    "name": "Senior Python Developer (Robotics, AI)",
    "salary_from": 250000,
    "salary_to": 500000,
    "url": "https://hh.ru/vacancy/83380963",
    "info": "Опыт разработки и проектирования робототехнических систем. Уверенный опыт разработки на Python. Технический английский язык - B2 и выше. ",
    "responsibility": "Глобально - участие в разработке нового продукта в области робототехники. Примеры задач - разработка ПО для робота для уборки улиц, автоматизация тестирования..."
  },
  {
    "name": "Team Lead Python",
    "salary_from": 300000,
    "salary_to": 420000,
    "url": "https://hh.ru/vacancy/83705773",
    "info": "Коммерческий опыт работы на Python от 5 лет. Опыт управления командой от 4 человек. Обязателен опыт работы с реляционными БД...",
    "responsibility": "Работать с коллегами, лидировать и наставлять их. Улучшать метрики команд. Улучшать процессы backend разработки. Необходимо разрабатывать стандарты."
  },
  {
    "name": "Backend Senior Python Developer (Team-Lead)",
    "salary_from": 1000000,
    "salary_to": null,
    "url": "https://hh.ru/vacancy/83026152",
    "info": "Писать код, много кода. Опыт коммерческой разработки на Python от 3х лет. Опыт работы с асинхронными фрейворками FastAPI/aiohttp. ",
    "responsibility": "Разрабатывать новые компоненты нашего продукта с нуля. Участвовать в разработке архитектуры. Проводить code-review коллег. Улучшать существующую часть продукта. "
  },
  {
    "name": "Senior Python разработчик (Django)",
    "salary_from": 280000,
    "salary_to": null,
    "url": "https://hh.ru/vacancy/69529590",
    "info": "Опыт работы с современным стеком и стандартами разработки. Опыт работы в MedTech с соблюдением требований к обработке персональных данных. ",
    "responsibility": "Приветствуем вовлеченность разработчиков в бизнес, а не просто написание кода по ТЗ. Ценим готовность брать ответственность и делиться опытом с..."
  },
  {
    "name": "Старший инженер-программист/Senior software engineer (Python/Full stack)",
    "salary_from": 450000,
    "salary_to": null,
    "url": "https://hh.ru/vacancy/82956783",
    "info": "более 10 лет коммерческого опыта работы в командной среде. - глубокие знания Python 3. - умение создавать чистый, структурированный код с понятными...",
    "responsibility": "разработка и улучшение приложения pSeven Enterprise с использованием Python 3.5+, Django, Tornado, Asyncio, Multiprocessing, GraphQL и других технологий. - "
  },
  {
    "name": "Senior Python developer",
    "salary_from": 12000000,
    "salary_to": 15000000,
    "url": "https://hh.ru/vacancy/83015982",
    "info": "Коммерческий опыт в разработке от 3х лет. Понимание SQL/NoSQL. Умение писать SQL запросы. Опыт разработки RESTful API. ",
    "responsibility": "Написание читаемого, тестируемого и эффективного кода. Разработка backend на Python Django/FastAPI. Разработка микросервисных решений. Интеграции с различными внешними системами."
  },
  {
    "name": "Разработчик Java (Android), Python",
    "salary_from": 250000,
    "salary_to": 300000,
    "url": "https://hh.ru/vacancy/83605065",
    "info": "Знание языков программирования: Java, Python. Опыт разработки мобильных приложений для android. Навыки решать задачи связанные с. Обменами (TCP/IP, AMQP...",
    "responsibility": "Разработка сервисов и внешних компонент для 1С для Android (Java). Разработка сервисов для SCADA и промышленной автоматизации (Python). "
  },
  {
    "name": "Разработчик Java (Android), Python",
    "salary_from": 250000,
    "salary_to": 300000,
    "url": "https://hh.ru/vacancy/82746222",
    "info": "Знание языков программирования: Java, Python. Опыт разработки мобильных приложений для android. Навыки решать задачи связанные с обменами (TCP/IP, AMQP...",
    "responsibility": "Разработка сервисов и внешних компонентов для 1С для Android (Java). Разработка сервисов для SCADA и промышленной автоматизации (Python). "
  },
  {
    "name": "Разработчик Python MLOps",
    "salary_from": 250000,
    "salary_to": null,
    "url": "https://hh.ru/vacancy/83055766",
    "info": "Опыт в разработке MLOps инструментов/платформ. Опыт разработки ML-моделей с помощью Pytorch/tensorflow. Опыт продуктивизации ML-моделей. ",
    "responsibility": "Разработка рабочего места исследователя данных в составе MLOps платформы, а также решения для serving-a моделей. Разработка системы для автоматического..."
  },
  {
    "name": "Преподаватель по Python",
    "salary_from": 2000000,
    "salary_to": 6000000,
    "url": "https://hh.ru/vacancy/83084250",
    "info": "Развитие не только теоретических знаний, но и практических умений и навыков программирования у слушателей. Отличное знание Python. Опыт в преподавании...",
    "responsibility": "Обучение слушателей работе с Python. Регулярная проверка домашнего задания. Разработанная и отточенная методика преподавания."
  },
  {
    "name": "Старший инженер-программист/Senior software engineer (Python/Full stack)",
    "salary_from": 450000,
    "salary_to": null,
    "url": "https://hh.ru/vacancy/82963288",
    "info": "более 10 лет коммерческого опыта работы в командной среде. - глубокие знания Python 3. - умение создавать чистый, структурированный код с понятными...",
    "responsibility": "разработка и улучшение приложения pSeven Enterprise с использованием Python 3.5+, Django, Tornado, Asyncio, Multiprocessing, GraphQL и других технологий. - "
  },
  {
    "name": "Team Lead Python",
    "salary_from": 300000,
    "salary_to": null,
    "url": "https://hh.ru/vacancy/81922758",
    "info": "Опыт управления командой разработчиков от 3-х лет. Опыт программирования на Python от 5-ти лет и знание его экосистемы. ",
    "responsibility": "Управление командой разработчиков: постановка целей, делегирование задач, контроль их исполнения. Участие в найме и мотивации сотрудников. Адаптация и обучение новых..."
  },
  {
    "name": "Senior Python Developer",
    "salary_from": 350000,
    "salary_to": null,
    "url": "https://hh.ru/vacancy/80803272",
    "info": "Готов работать не по четкому ТЗ, а по бизнес требованиям, и способен спроектировать масштабируемый поддерживаемый проект. Умеет работать в сжатых...",
    "responsibility": "Разрабатывать приложения в микросервисной архитектуре. Собирать инструментарий, из которого аналитики и data scientist-ы смогут без bolier plate кода собирать..."
  },
  {
    "name": "Старший инженер-программист/Senior software engineer (Python/Full stack)",
    "salary_from": 450000,
    "salary_to": null,
    "url": "https://hh.ru/vacancy/82963419",
    "info": "более 10 лет коммерческого опыта работы в командной среде. - глубокие знания Python 3. - умение создавать чистый, структурированный код с понятными...",
    "responsibility": "разработка и улучшение приложения pSeven Enterprise с использованием Python 3.5+, Django, Tornado, Asyncio, Multiprocessing, GraphQL и других технологий. - "
  },
  {
    "name": "Старший инженер-программист/Senior software engineer (Python/Full stack)",
    "salary_from": 450000,
    "salary_to": null,
    "url": "https://hh.ru/vacancy/82962792",
    "info": "более 10 лет коммерческого опыта работы в командной среде. - глубокие знания Python 3. - умение создавать чистый, структурированный код с понятными...",
    "responsibility": "разработка и улучшение приложения pSeven Enterprise с использованием Python 3.5+, Django, Tornado, Asyncio, Multiprocessing, GraphQL и других технологий. - "
  },
  {
    "name": "Старший инженер-программист/Senior software engineer (Python/Full stack)",
    "salary_from": 400000,
    "salary_to": null,
    "url": "https://hh.ru/vacancy/82963122",
    "info": "более 10 лет коммерческого опыта работы в командной среде. - глубокие знания Python 3. - умение создавать чистый, структурированный код с понятными...",
    "responsibility": "разработка и улучшение приложения pSeven Enterprise с использованием Python 3.5+, Django, Tornado, Asyncio, Multiprocessing, GraphQL и других технологий. - "
  },
  {
    "name": "Senior data scientist",
    "salary_from": 300000,
    "salary_to": 0,
    "url": "https://spb.superjob.ru/vakansii/senior-data-scientist-46668124.html",
    "info": "ФГБУ \"НМИЦ онкологии им. Н.Н. Петрова\" Минздрава России является одним из ведущих учреждений специализирующихся на оказание медицинской помощи по профилю \"онкология\". Учреждение имеет обширную базу исследований: лучевых методов диагностики, морфологии, а также большое количество медицинских данных пациентов с онкологическими заболеваниями. В настоящее время организация ищет руководителя лаборатории специализирующейся на разработки алгоритмов машинного обучения и искусственного интеллекта\nМы ищем руководителя DS команды для развития нескольких направлений\n* Компьютерное зрение - разработка систем по распознаванию информации: КТ снимки, маммографии, флюорографии легких и пр\n* LLM - создание помощников врача для онкологических пациентов. Взаимодействие с медицинскими информационными системами. Разработка систем принятия врачебных решений\n* Взаимодействие с носимой электроникой - анализ активности пациентов для определения риска развития осложнений\n* Разработка аналитической системы учреждения - прогноз потребности в медицинской помощи, расчет нагрузки оборудования, расчет рисков развития возникновения осложнений при оказания медицинской помощи\nЧем предстоит заниматься\n* Создание и руководство лабораторией DS (5 - 10 человек)\n* Развитие команды, управление эффективностью и качеством ее работы\n* Разработка и внедрение алгоритмов машинного обучения для повышения эффективности оказания медицинской помощи\n* Работа с метриками Машинного Обучения (Machine Learning), их сопоставление с бизнес-метриками Медицинской организации\n* В перспективе применение LLM (Больших Языковых Моделей) моделей для работы с медицинскими данными\nОсновные требования\n* Уверенный опыт работы в ML-направлении на позиции Senior/Lead, опыт управления командой DS приветствуется\n* Хорошие знания и опыт практического применения теории вероятностей и математической статистики \n* Знание основных алгоритмов и методов машинного обучение и анализа данных: линейные модели, ансамблевые методы, анализ и прогнозирование временных рядов (задачи классического Машинного Обучения)\n* Знание и опыт в области Глубокого Обучения (Deep Learning): сверточные нейронные сети (CNN); архитектуры для сегментации изображения - U-Net, Mask R-CNN, SAM; Трансформеры\n* Знание других архитектур (например, рекуррентные нейронные сети - RNN, LSTM) будет Вашим преимуществом\n* Опыт разработки ML-Конвейеров (Pipeline) на языках Python\n* Знание основного инструментария стека Python: Jupyter, Pandas, Scikit-learn, PyTorch/Tensorflow\n* Опыт работы с базами данных, владение языком запросов SQL;\n* Опыт внедрения корпоративных моделей данных, развития инструментов и систем для работы с данными\n* Развитые навыки коммуникации, способность быстро погружаться в специфику здравоохранения\n* Структурное мышление и умение излагать свои мысли\n* Опыт работы в сфере здравоохранения над проектами по ML и AI будет преимуществом\n- Знания английского языка будет Вашим преимуществом\nСтек\n* Разработка: Python, GitLab/GitHub, Docker, Kubernetes, AirFlow\n* Данные: Hadoop, PostgreSQL, Apache Airflow\nМы предлагаем\n* Трудоустройство в соответствии с ТК РФ\n* Белая зарплата\n* Возможность разрабатывать продукты востребованные для системы здравоохранения, которые позволяют повысить качество оказания медицинской помощи по профилю \"онкология\"\n* Возможность участвовать с презентацией проектов на профильных конференциях \n\n\nПросьба откликаться на вакансию полным резюме. В случае положительного результата рассмотрения резюме, Вы получите приглашение на интервью.",
    "responsibility": null
  }
]