[
    {
        "name": "Разработчик Python (Django, DRF)",
        "salary_from": 150000,
        "salary_to": 250000,
        "url": "https://hh.ru/vacancy/82929790",
        "info": "Основные технологии проекта: Django 2.2, DRF, PostgreSQL. Опыт веб-разработки от одного года, программирования не менее пяти лет. ",
        "responsibility": "Внимание: с командами не работаем, только с индивидуальными исполнителями. Профессиональный рост и участие в построении архитектур сложных систем.",
        "published_at": "05-08-2023 16:24:09"
    },
    {
        "name": "Разработчик Python",
        "salary_from": 160000,
        "salary_to": 180000,
        "url": "https://hh.ru/vacancy/83332307",
        "info": "Delphi (RAD Studio 2010 - RAD Studio RIO) приветствуется. Требования: Отличное знание SQL\\T-SQL\\PLPGSQL, опыт не менее 2 лет. ",
        "responsibility": "Коммерческое программное обеспечение - Билетная система \" Profticket\". Профиль Компании: автоматизация бизнес-процессов, деятельность которых связана с распространением билетов для зрителей на...",
        "published_at": "05-08-2023 12:14:45"
    },
    {
        "name": "Разработчик Python (FastAPI, MySQL, Clickhouse) удаленно",
        "salary_from": 180000,
        "salary_to": 270000,
        "url": "https://hh.ru/vacancy/82826027",
        "info": "Опыт коммерческой разработки с использованием Python, Mysql / PostgreSQL или другой реляционной БД от 3 лет. Плюсом будет знание: Clickhouse, Apache...",
        "responsibility": "Обязанности - разработка бэкенда рекламного сервиса. Стек проекта:",
        "published_at": "05-08-2023 10:04:47"
    },
    {
        "name": "Разработчик backend Python, Middle",
        "salary_from": 200000,
        "salary_to": null,
        "url": "https://hh.ru/vacancy/83574305",
        "info": "Обязательные компетенции: Python - опыт промышленной разработки с применением ООП. Опыт разработки многопоточных и асинхронных приложений на Python. Опыт разработки микросервисов...",
        "responsibility": "Ключевой проект – разработка торговых стратегий и сигналов для нашего партнера - американского алгоритмического Хедж-Фонда, входящий в ТОП 100 мира. ",
        "published_at": "04-08-2023 17:31:01"
    },
    {
        "name": "Разработчик Python Middle+ Senior",
        "salary_from": 250000,
        "salary_to": 350000,
        "url": "https://hh.ru/vacancy/83146353",
        "info": "Глубокое знание Python, способность писать код без фреймворков. Опыт коммерческой разработки на Python от 3х лет. Опыт разработки REST...",
        "responsibility": "Участвовать в разработке продуктов компании на языке программирования - Python. Разрабатывать и поддерживать интеграции со сторонними API. Взаимодействовать с командой аналитиков...",
        "published_at": "03-08-2023 14:14:06"
    }
]